Revit 2024 API
BuiltInFailures.FabricFailures.WrongFabricSheetOverallLength Property
 Wrong Overall Length/Width of the Fabric Sheet Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WrongFabricSheetOverallLength { get; }
Visual Basic
Public Shared ReadOnly Property WrongFabricSheetOverallLength As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WrongFabricSheetOverallLength {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace